stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_rtc_ex.h
/** @defgroup RTCEx_Alarm_Sub_Seconds_binary_Masks_Definitions RTC Alarm Sub Seconds with binary mode Masks Definitions
  * @{
  */
#define RTC_ALARMSUBSECONDBINMASK_ALL         0x00000000U                       /*!< All Alarm SS fields are masked.
                                                                                There is no comparison on sub seconds
                                                                                for Alarm */
#define RTC_ALARMSUBSECONDBINMASK_SS31_1      (1UL << RTC_ALRMASSR_MASKSS_Pos)  /*!< SS[31:1] are don't care in Alarm
                                                                                comparison.Only SS[0] is compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_2      (2UL << RTC_ALRMASSR_MASKSS_Pos)  /*!< SS[31:2] are don't care in Alarm
                                                                                comparison.Only SS[1:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_3      (3UL << RTC_ALRMASSR_MASKSS_Pos)  /*!< SS[31:3] are don't care in Alarm
                                                                                comparison.Only SS[2:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_4      (4UL << RTC_ALRMASSR_MASKSS_Pos)  /*!< SS[31:4] are don't care in Alarm
                                                                                comparison.Only SS[3:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_5      (5UL << RTC_ALRMASSR_MASKSS_Pos)  /*!< SS[31:5] are don't care in Alarm
                                                                                comparison.Only SS[4:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_6      (6UL << RTC_ALRMASSR_MASKSS_Pos)  /*!< SS[31:6] are don't care in Alarm
                                                                                comparison.Only SS[5:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_7      (7UL << RTC_ALRMASSR_MASKSS_Pos)  /*!< SS[31:7] are don't care in Alarm
                                                                                comparison.Only SS[6:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_8      (8UL << RTC_ALRMASSR_MASKSS_Pos)  /*!< SS[31:8] are don't care in Alarm
                                                                                comparison.Only SS[7:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_9      (9UL << RTC_ALRMASSR_MASKSS_Pos)  /*!< SS[31:9] are don't care in Alarm
                                                                                comparison.Only SS[8:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_10     (10UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:10] are don't care in Alarm
                                                                                comparison.Only SS[9:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_11     (11UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:11] are don't care in Alarm
                                                                                comparison.Only SS[10:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_12     (12UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:12] are don't care in Alarm
                                                                                comparison.Only SS[11:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_13     (13UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:13] are don't care in Alarm
                                                                                comparison.Only SS[12:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_14     (14UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:14] are don't care in Alarm
                                                                                comparison.Only SS[13:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_15     (15UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:15] are don't care in Alarm
                                                                                comparison.Only SS[14:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_16     (16UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:16] are don't care in Alarm
                                                                                comparison.Only SS[15:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_17     (17UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:17] are don't care in Alarm
                                                                                comparison.Only SS[16:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_18     (18UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:18] are don't care in Alarm
                                                                                comparison.Only SS[17:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_19     (19UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:19] are don't care in Alarm
                                                                                comparison.Only SS[18:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_20     (20UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:20] are don't care in Alarm
                                                                                comparison.Only SS[19:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_21     (21UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:21] are don't care in Alarm
                                                                                comparison.Only SS[20:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_22     (22UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:22] are don't care in Alarm
                                                                                comparison.Only SS[21:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_23     (23UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:23] are don't care in Alarm
                                                                                comparison.Only SS[22:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_24     (24UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:24] are don't care in Alarm
                                                                                comparison.Only SS[23:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_25     (25UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:25] are don't care in Alarm
                                                                                comparison.Only SS[24:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_26     (26UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:26] are don't care in Alarm
                                                                                comparison.Only SS[25:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_27     (27UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:27] are don't care in Alarm
                                                                                comparison.Only SS[26:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_28     (28UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:28] are don't care in Alarm
                                                                                comparison.Only SS[27:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_29     (29UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:29] are don't care in Alarm
                                                                                comparison.Only SS[28:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31_30     (30UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:30] are don't care in Alarm
                                                                                comparison.Only SS[29:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_SS31        (31UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31] is don't care in Alarm
                                                                                comparison.Only SS[30:0] are compared */
#define RTC_ALARMSUBSECONDBINMASK_NONE        (32UL << RTC_ALRMASSR_MASKSS_Pos) /*!< SS[31:0] are compared and must
                                                                                match to activate alarm.*/
/**
  * @}
  */

/** @defgroup RTCEx_Alarm_Sub_Seconds_binary_Clear_Definitions RTC Alarm Sub Seconds with binary mode auto clear
              Definitions
  * @{
  */
#define RTC_ALARMSUBSECONDBIN_AUTOCLR_NO    0UL                  /*!<  The synchronous Binary counter
                                                                       (SS[31:0] in RTC_SSR) is free-running. */
#define RTC_ALARMSUBSECONDBIN_AUTOCLR_YES   RTC_ALRMASSR_SSCLR   /*!<  The synchronous Binary counter
                                                                       (SS[31:0] in RTC_SSR) is running from 0xFFFFFFFF
                                                                       to RTC_ALRMABINR -> SS[31:0] value and is
                                                                       automatically reloaded with 0xFFFFFFFF
                                                                       whenreaching RTC_ALRMABINR -> SS[31:0]. */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup RTCEx_Exported_Macros RTCEx Exported Macros
  * @{
  */

/** @brief  Clear the specified RTC pending flag.
  * @param  __HANDLE__ specifies the RTC Handle.
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg @ref RTC_CLEAR_ITSF               Clear Internal Time-stamp flag
  *            @arg @ref RTC_CLEAR_TSOVF              Clear Time-stamp overflow flag
  *            @arg @ref RTC_CLEAR_TSF                Clear Time-stamp flag
  *            @arg @ref RTC_CLEAR_WUTF               Clear Wakeup timer flag
  *            @arg @ref RTC_CLEAR_ALRBF              Clear Alarm B flag
  *            @arg @ref RTC_CLEAR_ALRAF              Clear Alarm A flag
  *            @arg @ref RTC_CLEAR_SSRUF              Clear SSR underflow flag"
  * @retval None
  */
#define __HAL_RTC_CLEAR_FLAG(__HANDLE__, __FLAG__)   (UNUSED(__HANDLE__), (RTC->SCR = (__FLAG__)))

/** @brief  Check whether the specified RTC flag is set or not.
  * @param  __HANDLE__ specifies the RTC Handle.
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg @ref RTC_FLAG_RECALPF             Recalibration pending Flag
  *            @arg @ref RTC_FLAG_INITF               Initialization flag
  *            @arg @ref RTC_FLAG_RSF                 Registers synchronization flag
  *            @arg @ref RTC_FLAG_INITS               Initialization status flag
  *            @arg @ref RTC_FLAG_SHPF                Shift operation pending flag
  *            @arg @ref RTC_FLAG_WUTWF               Wakeup timer write flag
  *            @arg @ref RTC_FLAG_ITSF                Internal Time-stamp flag
  *            @arg @ref RTC_FLAG_TSOVF               Time-stamp overflow flag
  *            @arg @ref RTC_FLAG_TSF                 Time-stamp flag
  *            @arg @ref RTC_FLAG_WUTF                Wakeup timer flag
  *            @arg @ref RTC_FLAG_ALRBF               Alarm B flag
  *            @arg @ref RTC_FLAG_ALRAF               Alarm A flag
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_RTC_GET_FLAG(__HANDLE__, __FLAG__) \
  (UNUSED(__HANDLE__), (((((__FLAG__)) >> 8U) == 1U) ? (RTC->ICSR & (1U << (((uint16_t)(__FLAG__)) & RTC_IT_MASK))) : \
   (RTC->SR & (1U << (((uint16_t)(__FLAG__)) & RTC_IT_MASK)))))

/* ---------------------------------WAKEUPTIMER---------------------------------*/
/** @defgroup RTCEx_WakeUp_Timer RTC WakeUp Timer
  * @{
  */
/**
  * @brief  Enable the RTC WakeUp Timer peripheral.
  * @param  __HANDLE__ specifies the RTC handle.
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_ENABLE(__HANDLE__)                      (UNUSED(__HANDLE__), (RTC->CR |= (RTC_CR_WUTE)))

/**
  * @brief  Disable the RTC WakeUp Timer peripheral.
  * @param  __HANDLE__ specifies the RTC handle.
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_DISABLE(__HANDLE__)                     (UNUSED(__HANDLE__), (RTC->CR &= ~(RTC_CR_WUTE)))

/**
  * @brief  Enable the RTC WakeUpTimer interrupt.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __INTERRUPT__ specifies the RTC WakeUpTimer interrupt sources to be enabled.
  *         This parameter can be:
  *            @arg @ref RTC_IT_WUT WakeUpTimer interrupt
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_ENABLE_IT(__HANDLE__, __INTERRUPT__)    (UNUSED(__HANDLE__), (RTC->CR |= (__INTERRUPT__)))

/**
  * @brief  Disable the RTC WakeUpTimer interrupt.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __INTERRUPT__ specifies the RTC WakeUpTimer interrupt sources to be disabled.
  *         This parameter can be:
  *            @arg @ref RTC_IT_WUT WakeUpTimer interrupt
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_DISABLE_IT(__HANDLE__, __INTERRUPT__)   (UNUSED(__HANDLE__), (RTC->CR &= ~(__INTERRUPT__)))


/**
  * @brief  Check whether the specified RTC WakeUpTimer interrupt has occurred or not.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __INTERRUPT__ specifies the RTC WakeUpTimer interrupt to check.
  *         This parameter can be:
  *            @arg @ref RTC_IT_WUT  WakeUpTimer interrupt
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_RTC_WAKEUPTIMER_GET_IT(__HANDLE__, __INTERRUPT__)       (UNUSED(__HANDLE__), ((((RTC->MISR) &\
                                                                         ((__INTERRUPT__)>> 12U)) != 0UL) ? 1UL : 0UL))
/**
  * @brief  Check whether the specified RTC Wake Up timer interrupt has been enabled or not.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __INTERRUPT__ specifies the RTC Wake Up timer interrupt sources to check.
  *         This parameter can be:
  *            @arg @ref RTC_IT_WUT  WakeUpTimer interrupt
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_RTC_WAKEUPTIMER_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)   (UNUSED(__HANDLE__), ((((RTC->CR) &\
                                                                            (__INTERRUPT__)) != 0UL) ? 1UL : 0UL))

/**
  * @brief  Get the selected RTC WakeUpTimers flag status.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __FLAG__ specifies the RTC WakeUpTimer Flag is pending or not.
  *          This parameter can be:
  *             @arg @ref RTC_FLAG_WUTF
  *             @arg @ref RTC_FLAG_WUTWF
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_RTC_WAKEUPTIMER_GET_FLAG(__HANDLE__, __FLAG__)   (__HAL_RTC_GET_FLAG((__HANDLE__), (__FLAG__)))

/**
  * @brief  Clear the RTC Wake Up timers pending flags.
  * @param  __HANDLE__ specifies the RTC handle.
  * @param  __FLAG__ specifies the RTC WakeUpTimer Flag to clear.
  *         This parameter can be:
  *            @arg @ref RTC_FLAG_WUTF
  * @retval None
  */
#define __HAL_RTC_WAKEUPTIMER_CLEAR_FLAG(__HANDLE__, __FLAG__)     (__HAL_RTC_CLEAR_FLAG((__HANDLE__), RTC_CLEAR_WUTF))

